# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
    
#     *Пример:*
    
#     - Для N = 5: 1, -3, 9, -27, 81

# number = int(input('Input integer number: '))

# for degree in range(number):
#     print((-3) ** degree, end = ' ')


##########################################################################################################

# 1. Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N
    
#     *Примеры:* 
    
#     при 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5


# num = int(input('Input a number: '))

# for i in range (-num, num + abs(num) // num, abs(num)// num):
#     print(i , end = ' ')

############################################################################################################


# 2. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
    
#     *Примеры:*
    
#     - 6,78 -> 7
#     - 5 -> нет
#     - 0,34 -> 3


num = float(input('Input a number: '))


# if(int(num) == num):
#     print('No')
# else:
#     print(int(abs(num) * 10 % 10))

       
# Второе решение 
num = str(num)

num = num.split('.')

if len(num) > 1:
    print(num[1][0])
else:
    print('No')    
