# string = '1 2 3 4 5 6 07'

# string = string.split()

# for i in enumerate(string, 5):
#     print(f' {i}')


# Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.

# *Пример:* 

# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]    Нужен словарь  

# my_list = [1, 2, 3, 5, 1, 5, 3, 10]

# print(my_list)

# my_list = list(filter(lambda x: x % 2 == 0, my_list))
# print(my_list)

# my_list = [1, 2, 3, 5, 1, 5, 3, 10]

# my_dit = {}

# new_data = list(filter(lambda x: data.count(x) == 1, data))



# 1. Напишите программу вычисления арифметического выражения заданного строкой. Используйте операции +,-,/,*. приоритет операций стандартный. 
    
#     *Пример:* 
    
#     2+2 => 4; 
    
#     1+2*3 => 7; 
    
#     1-2*3 => -5;



